Revit 2027 API
FabricationPart.CanSplitStraight Method
 Validates if the straight can be split into two at the passed in point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSplitStraight(
	XYZ position
)
Public Function CanSplitStraight (
	position As XYZ
) As Boolean
public:
bool CanSplitStraight(
	XYZ^ position
)
member CanSplitStraight :
        position : XYZ -> bool
Parameters
position XYZ
 The position to split in the straight.
Return Value
Boolean
 Returns true if valid otherwise false if the straight cannot be split.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace